zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_fmc.h
/*!
    \file    gd32c2x1_fmc.h
    \brief   definitions for the FMC

    \version 2025-08-08, V1.1.0, firmware for gd32c2x1
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32C2X1_FMC_H
#define GD32C2X1_FMC_H

#include "gd32c2x1.h"

/* FMC and option bytes definition */
#define FMC                                    FMC_BASE                                         /*!< FMC base address */

/* registers definitions */
#define FMC_WS                                 REG32(FMC + 0x00000000U)                         /*!< FMC wait state register */
#define FMC_KEY                                REG32(FMC + 0x00000008U)                         /*!< FMC unlock key register */
#define FMC_OBKEY                              REG32(FMC + 0x0000000CU)                         /*!< FMC option bytes unlock key register */
#define FMC_STAT                               REG32(FMC + 0x00000010U)                         /*!< FMC status register */
#define FMC_CTL                                REG32(FMC + 0x00000014U)                         /*!< FMC control register */
#define FMC_OBCTL                              REG32(FMC + 0x00000020U)                         /*!< FMC option byte register */
#define FMC_DCRP_SADDR0                        REG32(FMC + 0x00000024U)                         /*!< FMC DCRP area 0 start address register */
#define FMC_DCRP_EADDR0                        REG32(FMC + 0x00000028U)                         /*!< FMC DCRP area 0 end address register */
#define FMC_WP0                                REG32(FMC + 0x0000002CU)                         /*!< FMC erase/program protection area 0 register */
#define FMC_WP1                                REG32(FMC + 0x00000030U)                         /*!< FMC erase/program protection area 1 register */
#define FMC_DCRP_SADDR1                        REG32(FMC + 0x00000034U)                         /*!< FMC DCRP area 1 start address register */
#define FMC_DCRP_EADDR1                        REG32(FMC + 0x00000038U)                         /*!< FMC DCRP area 1 end address register */
#define FMC_SCR                                REG32(FMC + 0x00000080U)                         /*!< FMC securable area register */
#define FMC_PID                                REG32(FMC + 0x00000110U)                         /*!< FMC product ID register */

/* bits definitions */
/* FMC_WS */
#define FMC_WS_WSCNT                           BITS(0,2)                                        /*!< wait state counter */
#define FMC_WS_PFEN                            BIT(8)                                           /*!< pre-fetch enable */
#define FMC_WS_ICEN                            BIT(9)                                           /*!< IBUS cache enable */
#define FMC_WS_ICRST                           BIT(11)                                          /*!< IBUS cache reset */
#define FMC_WS_MFPE                            BIT(16)                                          /*!< main flash programmed or empty flag */
#define FMC_WS_DBGEN                           BIT(18)                                          /*!< enable/disable the debugger by software */

/* FMC_KEY */
#define FMC_KEY_KEY                            BITS(0,31)                                       /*!< FMC_CTL unlock key */

/* FMC_OBKEY */
#define FMC_OBKEY_OBKEY                        BITS(0,31)                                       /*!< option bytes unlock key */

/* FMC_STAT */
#define FMC_STAT_ENDF                          BIT(0)                                           /*!< end of operation flag */
#define FMC_STAT_OPRERR                        BIT(1)                                           /*!< operation error flag bit */
#define FMC_STAT_PGERR                         BIT(3)                                           /*!< program error flag */
#define FMC_STAT_WPERR                         BIT(4)                                           /*!< erase/program protection error flag bit */
#define FMC_STAT_PGAERR                        BIT(5)                                           /*!< program alignment error flag */
#define FMC_STAT_PGMERR                        BIT(6)                                           /*!< program size not match error flag bit */
#define FMC_STAT_PGSERR                        BIT(7)                                           /*!< program sequence error flag bit */
#define FMC_STAT_FSTPERR                       BIT(9)                                           /*!< fast programming error flag bit */
#define FMC_STAT_RPERR                         BIT(14)                                          /*!< read protection error flag bit */
#define FMC_STAT_OBERR                         BIT(15)                                          /*!< option byte read error bit */
#define FMC_STAT_BUSY                          BIT(16)                                          /*!< flash busy flag */

/* FMC_CTL */
#define FMC_CTL_PG                             BIT(0)                                           /*!< main flash page program command bit */
#define FMC_CTL_PER                            BIT(1)                                           /*!< main flash page erase command bit */
#define FMC_CTL_MER                            BIT(2)                                           /*!< main flash mass erase command bit */
#define FMC_CTL_PN                             BITS(3,8)                                        /*!< page number to erase */
#define FMC_CTL_START                          BIT(16)                                          /*!< send erase command to FMC bit */
#define FMC_CTL_OBSTART                        BIT(17)                                          /*!< option byte change command */
#define FMC_CTL_FSTPG                          BIT(18)                                          /*!< send option byte change command to FMC bit */
#define FMC_CTL_ENDIE                          BIT(24)                                          /*!< end of operation interrupt enable bit */
#define FMC_CTL_ERRIE                          BIT(25)                                          /*!< operation error interrupt enable bit */
#define FMC_CTL_RPERRIE                        BIT(26)                                          /*!< read protection error interrupt enable bit */
#define FMC_CTL_OBRLD                          BIT(27)                                          /*!< option byte reload bit */
#define FMC_CTL_SCR                            BIT(28)                                          /*!< security protection enable bit */
#define FMC_CTL_OBLK                           BIT(30)                                          /*!< FMC_OBCTL lock bit */
#define FMC_CTL_LK                             BIT(31)                                          /*!< FMC_CTL lock bit */

/* FMC_OBCTL */
#define FMC_OBCTL_SPC                          BITS(0,7)                                        /*!< security protection value */
#define FMC_OBCTL_BORST_EN                     BIT(8)                                           /*!< brown out reset enable */
#define FMC_OBCTL_BORR_TH                      BITS(9,10)                                       /*!< BOR threshold at rising VDD supply */
#define FMC_OBCTL_BORF_TH                      BITS(11,12)                                      /*!< BOR threshold at falling VDD supply */
#define FMC_OBCTL_NRST_STDBY                   BIT(14)                                          /*!< option byte standby reset value bit */
#define FMC_OBCTL_HXTAL_REMAP                  BIT(21)                                          /*!< HXTAL remapping bit */
#define FMC_OBCTL_SRAM_ECC_EN                  BIT(22)                                          /*!< SRAM ECC disable bit */
#define FMC_OBCTL_NRST_DPSLP                   BIT(13)                                          /*!< option byte deepsleep reset value bit */
#define FMC_OBCTL_NFWDG_HW                     BIT(16)                                          /*!< free watchdog configuration bit */
#define FMC_OBCTL_NWWDG_HW                     BIT(19)                                          /*!< window watchdog configuration bit */
#define FMC_OBCTL_SWBT0                        BIT(24)                                          /*!< software BOOT0 bit */
#define FMC_OBCTL_NBOOT1                       BIT(25)                                          /*!< NBOOT1 option bit */
#define FMC_OBCTL_NBOOT0                       BIT(26)                                          /*!< NBOOT0 option bit */
#define FMC_OBCTL_NRST_MDSEL                   BITS(27,28)                                      /*!< NRST pin mode bit */

/* FMC_DCRP_SADDR0 */
#define FMC_DCRP_SADDR0_DCRP0_SADDR            BITS(0,6)                                        /*!< start offset of DCRP area 0 */

/* FMC_DCRP_EADDR0 */ 
#define FMC_DCRP_EADDR0_DCRP0_EADDR            BITS(0,6)                                        /*!< end offset DCRP area0 */
#define FMC_DCRP_EADDR0_DCRP_EREN              BIT(31)                                          /*!< DCRP area erase enable configuration bit */

/* FMC_WP0 */
#define FMC_WP0_WP0_SADDR                      BITS(0,5)                                        /*!< start offset of write protection area 0 */
#define FMC_WP0_WP0_EADDR                      BITS(16,21)                                      /*!< end offset of write protection area 0 */

/* FMC_WP1 */
#define FMC_WP1_WP1_SADDR                      BITS(0,5)                                        /*!< start offset of write protection area 1 */
#define FMC_WP1_WP1_EADDR                      BITS(16,21)                                      /*!< end offset of write protection area 1 */

/* FMC_DCRP_SADDR1 */ 
#define FMC_DCRP_SADDR1_DCRP1_SADDR            BITS(0,6)                                        /*!< start offset of DCRP area1 */
                                                                                               
