zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_fmc.h
/* FMC_DCRP_EADDR1 */                                                                       
#define FMC_DCRP_EADDR1_DCRP1_EADDR            BITS(0,6)                                        /*!< end offset DCRP area 1 */

/* FMC_SCR */
#define FMC_SCR_SCR_PAGE_CNT                   BITS(0,6)                                        /*!< configure the number of pages of securable area */
#define FMC_SCR_BOOTLK                         BIT(16)                                          /*!< this bit is set to force boot from user flash area */

/* FMC_PID */
#define FMC_PID_PID                            BITS(0,31)                                       /*!< product ID bits */

/* constants definitions */
/* FMC_CTL unlock key */
#define FMC_UNLOCK_KEY0                        ((uint32_t)0x45670123U)                          /*!< FMC_CTL unlock key 0 */
#define FMC_UNLOCK_KEY1                        ((uint32_t)0xCDEF89ABU)                          /*!< FMC_CTL unlock key 1 */

/* FMC_CTL_OBLK unlock key */
#define OB_UNLOCK_KEY0                         ((uint32_t)0x08192A3B)                           /*!< FMC_CTL_OBLK unlock key 0 */
#define OB_UNLOCK_KEY1                         ((uint32_t)0x4C5D6E7F)                           /*!< FMC_CTL_OBLK unlock key 1 */

/* FMC wait state added */
#define WS_WSCNT(regval)                       (BITS(0,2) & ((uint32_t)(regval)))
#define FMC_WAIT_STATE_0                       WS_WSCNT(0)                                      /*!< 0 wait state added */
#define FMC_WAIT_STATE_1                       WS_WSCNT(1)                                      /*!< 1 wait state added */

/* FMC first location empty check status */
#define WS_MFPE(regval)                        (BIT(16) & ((uint32_t)(regval)))
#define FMC_WS_MFPE_PROGRAMMED                 WS_MFPE(0)                                       /*!< the first location of main flash is programmed */
#define FMC_WS_MFPE_EMPTY                      WS_MFPE(1)                                       /*!< the first location of main flash is empty */

/* option byte security protection configuration */
#define FMC_NSPC                               ((uint8_t)0xA5U)                                 /*!< no protection */
#define FMC_LSPC                               ((uint8_t)0xBBU)                                 /*!< protection level low */
#define FMC_HSPC                               ((uint8_t)0xCCU)                                 /*!< protection level high */

/* option byte BOR threshold value at rising VDD supply */
#define OBCTL_BORR_TH(regval)                  (BITS(9,10) & ((uint32_t)(regval) << 9U))
#define OB_BORR_TH_VALUE0                      OBCTL_BORR_TH(0)                                 /*!< BOR rising level 1 */
#define OB_BORR_TH_VALUE1                      OBCTL_BORR_TH(1)                                 /*!< BOR rising level 2 */
#define OB_BORR_TH_VALUE2                      OBCTL_BORR_TH(2)                                 /*!< BOR rising level 3 */
#define OB_BORR_TH_VALUE3                      OBCTL_BORR_TH(3)                                 /*!< BOR rising level 4 */

/* option byte BOR threshold value at falling VDD supply */
#define OBCTL_BORF_TH(regval)                  (BITS(11,12) & ((uint32_t)(regval) << 11U))
#define OB_BORF_TH_VALUE0                      OBCTL_BORF_TH(0)                                 /*!< BOR falling level 1 */
#define OB_BORF_TH_VALUE1                      OBCTL_BORF_TH(1)                                 /*!< BOR falling level 2 */
#define OB_BORF_TH_VALUE2                      OBCTL_BORF_TH(2)                                 /*!< BOR falling level 3 */
#define OB_BORF_TH_VALUE3                      OBCTL_BORF_TH(3)                                 /*!< BOR falling level 4 */

/* option byte BOR reset configuration */
#define OBCTL_BORST(regval)                   (BIT(8) & ((uint32_t)(regval) << 8U))
#define OB_BORST_DISABLE                      (OBCTL_BORST(0))                                  /*!< Brown out reset disable, power-on reset defined by POR/PDR levels */
#define OB_BORST_ENABLE                       (OBCTL_BORST(1))                                  /*!< Brown out reset enable, values of BORR_TH and BORF_TH taken into account */

/* option byte reset or not entering deep sleep mode */
#define OBCTL_NRST_DPSLP(regval)               (BIT(13) & ((uint32_t)(regval) << 13U))
#define OB_DEEPSLEEP_RST                       OBCTL_NRST_DPSLP(0)                              /*!< generate a reset instead of entering deepsleep mode */
#define OB_DEEPSLEEP_NRST                      OBCTL_NRST_DPSLP(1)                              /*!< no reset when entering deepsleep mode */

/* option byte reset or not entering standby mode */
#define OBCTL_NRST_STDBY(regval)               (BIT(14) & ((uint32_t)(regval) << 14U))
#define OB_STDBY_RST                           OBCTL_NRST_STDBY(0)                              /*!< generate a reset instead of entering standby mode */
#define OB_STDBY_NRST                          OBCTL_NRST_STDBY(1)                              /*!< no reset when entering deepsleep mode */

/* option byte software/hardware free watchdog timer */
#define OBCTL_NFWDG_HW(regval)                 (BIT(16) & ((uint32_t)(regval) << 16U))
#define OB_FWDGT_HW                            OBCTL_NFWDG_HW(0)                                /*!< hardware free watchdog */
#define OB_FWDGT_SW                            OBCTL_NFWDG_HW(1)                                /*!< software free watchdog */

/* option byte software/hardware window watchdog timer */
#define OBCTL_NWWDG_HW(regval)                 (BIT(19) & ((uint32_t)(regval) << 19U))
#define OB_WWDGT_HW                            OBCTL_NWWDG_HW(0)                                /*!< hardware window watchdog */
#define OB_WWDGT_SW                            OBCTL_NWWDG_HW(1)                                /*!< software window watchdog */

/* option byte software boot0 */
#define OBCTL_SWBT0(regval)                    (BIT(24) & ((uint32_t)(regval) << 24U))
#define OB_SWBOOT0_FROM_OB_BOOT0               OBCTL_SWBT0(1)                                   /*!< BOOT0 taken from the option bit nBOOT0 */
#define OB_SWBOOT0_FROM_PIN                    OBCTL_SWBT0(0)                                   /*!< BOOT0 taken from PB8/BOOT0 pin */

