zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_fmc.h
/* option byte boot1 configuration */
#define OBCTL_NBOOT1(regval)                   (BIT(25) & ((uint32_t)(regval) << 25U))
#define OB_NBOOT1_VALUE_0                      OBCTL_NBOOT1(0)                                  /*!< option byte NBOOT1 is value 0 */
#define OB_NBOOT1_VALUE_1                      OBCTL_NBOOT1(1)                                  /*!< option byte NBOOT1 is value 1 */

/* option byte boot0 configuration */
#define OBCTL_NBOOT0(regval)                   (BIT(26) & ((uint32_t)(regval) << 26U))
#define OB_NBOOT0_VALUE_0                      OBCTL_NBOOT0(0)                                  /*!< option byte NBOOT0 is value 0 */
#define OB_NBOOT0_VALUE_1                      OBCTL_NBOOT0(1)                                  /*!< option byte NBOOT0 is value 1 */

/* option byte reset pin mode */
#define OBCTL_NRST_MDSEL(regval)               (BITS(27,28) & ((uint32_t)(regval) << 27U))
#define OB_NRST_PIN_INPUT_MODE                 OBCTL_NRST_MDSEL(1)                              /*!< a low level on the NRST pin can reset system, internal reset can not drive NRST pin */
#define OB_NRST_PIN_NORMAL_GPIO                OBCTL_NRST_MDSEL(2)                              /*!< NRST pin function as normal GPIO */
#define OB_NRST_PIN_INPUT_OUTPUT_MODE          OBCTL_NRST_MDSEL(3)                              /*!< NRST pin configure as input/output mode */

/* option byte DCRP erase enable configuration */
#define OB_DCRP_EADDR_DCRP_EREN(regval)        (BIT(31) & ((uint32_t)(regval) << 31U))
#define OB_DCRP_AREA_ERASE_DISABLE             OB_DCRP_EADDR_DCRP_EREN(0)                       /*!< DCRP is not erased when a SPC value is decreased from value 1 to value 0 */
#define OB_DCRP_AREA_ERASE_ENABLE              OB_DCRP_EADDR_DCRP_EREN(1)                       /*!< DCRP is erased when a SPC value is decreased from value 1 to value 0 */

/* option byte boot lock */
#define OB_SCR_BOOTLK(regval)                  (BIT(16) & ((uint32_t)(regval) << 16U))
#define OB_BOOT_UNLOCK                         OB_SCR_BOOTLK(0)                                 /*!< unlock boot */
#define OB_BOOT_LOCK_FROM_MAIN_FLASH           OB_SCR_BOOTLK(1)                                 /*!< boot from main flash */

/* option byte HXTAL remapping */
#define OB_HXTAL_REMAP(regval)                 (BIT(21) & ((uint32_t)(regval) << 21U))
#define OB_HXTAL_REMAP_ENABLE                  OB_HXTAL_REMAP(0)                                /*!< HXTAL remapping enable */
#define OB_HXTAL_REMAP_DISABLE                 OB_HXTAL_REMAP(1)                                /*!< HXTAL remapping disable */

/* option byte SRAM ECC disable */
#define OB_SRAM_ECC_EN(regval)                 (BIT(22) & ((uint32_t)(regval) << 22U))
#define OB_SRAM_ECC_ENABLE                      OB_SRAM_ECC_EN(0)                               /*!< SRAM ECC check enable */
#define OB_SRAM_ECC_DISABLE                     OB_SRAM_ECC_EN(1)                               /*!< SRAM ECC check disable */

/* FMC interrupt enable */
#define FMC_INT_END                            FMC_CTL_ENDIE                                    /*!< FMC end of operation interrupt enable */
#define FMC_INT_ERR                            FMC_CTL_ERRIE                                    /*!< FMC error interrupt enable */
#define FMC_INT_RPERR                          FMC_CTL_RPERRIE                                  /*!< read protection error interrupt enable */

/* FMC flags */
#define FMC_FLAG_BUSY                          FMC_STAT_BUSY                                    /*!< FMC busy flag */
#define FMC_FLAG_ENDF                          FMC_STAT_ENDF                                    /*!< FMC end of operation flag */
#define FMC_FLAG_OBERR                         FMC_STAT_OBERR                                   /*!< option byte read error */
#define FMC_FLAG_RPERR                         FMC_STAT_RPERR                                   /*!< read protection error */
#define FMC_FLAG_FSTPERR                       FMC_STAT_FSTPERR                                 /*!< fast programming error */
#define FMC_FLAG_PGSERR                        FMC_STAT_PGSERR                                  /*!< program sequence error */
#define FMC_FLAG_PGMERR                        FMC_STAT_PGMERR                                  /*!< program size error*/
#define FMC_FLAG_PGAERR                        FMC_STAT_PGAERR                                  /*!< program alignment error */
#define FMC_FLAG_WPERR                         FMC_STAT_WPERR                                   /*!< erase/program protection error */
#define FMC_FLAG_PGERR                         FMC_STAT_PGERR                                   /*!< program error */
#define FMC_FLAG_OPRERR                        FMC_STAT_OPRERR                                  /*!< operation error */

/* FMC interrupt flags */
#define FMC_INT_FLAG_RPERR                     FMC_STAT_RPERR                                   /*!< read protection error interrupt flag */
#define FMC_INT_FLAG_OPRERR                    FMC_STAT_OPRERR                                  /*!< operation error interrupt flag */
#define FMC_INT_FLAG_END                       FMC_STAT_ENDF                                    /*!< end of operation interrupt flag */

#define OBCTL_SPC_OFFSET                       (0U)                                             /*!< bit offset of SPC offset in FMC_OBCTL register */
#define OBCTL_USER_OFFSET                      (8U)                                             /*!< bit offset of USER offset in FMC_OBCTL register */
#define CTL_PN_OFFSET                          (3U)                                             /*!< bit offset of PNSEL offset in FMC_CTL register */
#define SCR_PAGE_CNT_OFFSET                    (0U)                                             /*!< bit offset of SCR_PAGE_CNT in FMC_SCR */
#define DCRP_SADDR_OFFSET                      (0U)                                             /*!< bit offset of DCRP0_SADDR/DCRP1_SADDR in FMC_DCRP_SADDR0/FMC_DCRP_SADDR1 */
#define DCRP_EADDR_OFFSET                      (0U)                                             /*!< bit offset of DCRP0_EADDR/DCRP1_EADDR in FMC_DCRP_EADDR0/FMC_DCRP_EADDR1 */
#define DCRP_EREN_OFFSET                       (31U)                                            /*!< bit offset of DCRP_EREN in FMC_DCRP_EADDR */
#define WP_SADDR_OFFSET                        (0U)                                             /*!< bit offset of WP0_SADDR/WP1_SADDR in FMC_WP0/FMC_WP1 */
#define WP_EADDR_OFFSET                        (16U)                                            /*!< bit offset of WP0_EADDR/WP1_EADDR in FMC_WP0/FMC_WP1 */

