zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_fmc.h
#define MAIN_FLASH_BASE_ADDRESS                ((uint32_t)0x08000000U)                          /*!< main flash base address */
#define MAIN_FLASH_SIZE                        ((uint32_t)0x00010000U)                          /*!< main flash size */
#define MAIN_FLASH_PAGE_SIZE                   ((uint32_t)0x00000400U)                          /*!< main flash sub page size */ 
#define MAIN_FLASH_PAGE_TOTAL_NUM              ((uint32_t)0x00000040U)                          /*!< main flash page total number */
#define FMC_TIMEOUT_COUNT                      ((uint32_t)0xFFFFFFFFU)                          /*!< count to judge FMC timeout */
#define DOUBLEWORD_CNT_IN_ROW                  ((uint8_t)8U)
#define DCRP_AREA_SUBPAGE_SIZE                 ((uint32_t)0x00000200U)                          /*!< DCRP area subpage size */
#define DCRP_AREA_SUBPAGE_MAX_INDEX            ((MAIN_FLASH_SIZE / DCRP_AREA_SUBPAGE_SIZE) - 1U)/*!< DCRP area subpage max index */
#define WP_AREA_SUBPAGE_SIZE                   ((uint32_t)0x00000400U)                          /*!< write protection area subpage size */

#define INVLD_RETURN_VALUE                     ((uint32_t)0x00000000U)                          /*!< the return value is invalid */
#define VLD_RETURN_VALUE                       ((uint32_t)0x00000001U)                          /*!< the return value is valid */

/* DCRP area definition */
#define DCRP_AREA_0                            ((uint32_t)0x00000000U)                          /*!< DCRP area 0 */
#define DCRP_AREA_1                            ((uint32_t)0x00000001U)                          /*!< DCRP area 1 */
/* write protection area definition */
#define WP_AREA_0                              ((uint32_t)0x00000000U)                          /*!< write protection area 0 */
#define WP_AREA_1                              ((uint32_t)0x00000001U)                          /*!< write protection area 1 */

/* fmc state */
typedef enum {
    FMC_READY = 0,                                                                              /*!< the operation has been completed */
    FMC_BUSY,                                                                                   /*!< the operation is in progress */
    FMC_OBERR,                                                                                  /*!< option byte read error */
    FMC_RPERR,                                                                                  /*!< read protection error */
    FMC_FSTPERR,                                                                                /*!< fast programming error */
    FMC_PGSERR,                                                                                 /*!< program sequence error */
    FMC_PGMERR,                                                                                 /*!< program size error*/
    FMC_PGAERR,                                                                                 /*!< program alignment error */
    FMC_WPERR,                                                                                  /*!< erase/program protection error */
    FMC_PGERR,                                                                                  /*!< program error */
    FMC_OPRERR,                                                                                 /*!< operation error */
    FMC_TOERR,                                                                                  /*!< timeout error */
    FMC_OB_HSPC,                                                                                /*!< high security protection */
    FMC_UNDEFINEDERR                                                                            /*!< undefined error for function input parameter checking */
} fmc_state_enum;

/* user data extract infomation */
typedef enum {
    OBCTL_USER_DATA_BORST_EN              =          FMC_OBCTL_BORST_EN | 8U,                    /*!< brown out reset enable mask and it's start bit position */
    OBCTL_USER_DATA_BORR_TH               =          FMC_OBCTL_BORR_TH | 9U,                     /*!< BOR threshold at rising VDD supply mask and it's start bit position */
    OBCTL_USER_DATA_BORF_TH               =          FMC_OBCTL_BORF_TH | 11U,                    /*!< BOR threshold at falling VDD supply mask and it's start bit position */
    OBCTL_USER_DATA_NRST_STDBY            =          FMC_OBCTL_NRST_STDBY | 14U,                 /*!< option byte standby reset value bit mask and it's start bit position */
    OBCTL_USER_DATA_HXTAL_REMAP           =          FMC_OBCTL_HXTAL_REMAP | 21U,                /*!< HXTAL remapping bit mask and it's start bit position */
    OBCTL_USER_DATA_SRAM_ECC_EN           =          FMC_OBCTL_SRAM_ECC_EN | 22U,                /*!< SRAM ECC enable bit mask and it's start bit position */ 
    OBCTL_USER_DATA_NRST_DPSLP            =          FMC_OBCTL_NRST_DPSLP | 13U,                 /*!< option byte deepsleep reset value bit mask and it's start bit position */
    OBCTL_USER_DATA_NFWDG_HW              =          FMC_OBCTL_NFWDG_HW | 16U,                   /*!< free watchdog configuration bit mask and it's start bit position */
    OBCTL_USER_DATA_NWWDG_HW              =          FMC_OBCTL_NWWDG_HW | 19U,                   /*!< window watchdog configuration bit mask and it's start bit position */
    OBCTL_USER_DATA_SWBT0                 =          FMC_OBCTL_SWBT0 | 24U,                      /*!< software BOOT0 bit mask and it's start bit position */
    OBCTL_USER_DATA_NBOOT1                =          FMC_OBCTL_NBOOT1 | 25U,                     /*!< NBOOT1 option bit mask and it's start bit position */
    OBCTL_USER_DATA_NBOOT0                =          FMC_OBCTL_NBOOT0 | 26U,                     /*!< NBOOT0 option bit mask and it's start bit position */
    OBCTL_USER_DATA_NRST_MDSEL            =          FMC_OBCTL_NRST_MDSEL | 27U                  /*!< NRST pin mode bit mask and it's start bit position */
} ob_user_data_extract_info_enum;

