zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_fmc.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check FMC empty check status */
#define NOT_FMC_EMPTY_CHECK_STATUS(empty_check_status)       ((empty_check_status) & (~FMC_WS_MFPE))

/* check FMC wait state configuration */
#define NOT_FMC_WAIT_STATE(wscnt)                            ((wscnt) > FMC_WAIT_STATE_1)

/* check FMC option byte USER mask */
#define NOT_FMC_OB_USER_MASK(ob_user_mask)                   ((ob_user_mask) & ~(FMC_OBCTL_BORST_EN    | FMC_OBCTL_BORR_TH  | FMC_OBCTL_BORF_TH  | FMC_OBCTL_NRST_DPSLP  | \
                                                                                 FMC_OBCTL_NRST_STDBY  | FMC_OBCTL_NFWDG_HW | FMC_OBCTL_NWWDG_HW | FMC_OBCTL_HXTAL_REMAP | \
                                                                                 FMC_OBCTL_SRAM_ECC_EN | FMC_OBCTL_SWBT0    | FMC_OBCTL_NBOOT1   | FMC_OBCTL_NBOOT0      | \
                                                                                 FMC_OBCTL_NRST_MDSEL ))

/* check FMC DCRP area configuration */
#define NOT_FMC_DCRP_AREA_VALID_CFG(dcrp_area,dcrp_eren,dcrp_start,dcrp_end)               ((((dcrp_area) != DCRP_AREA_0) && ((dcrp_area) != DCRP_AREA_1)) || \
                                                                                            (0U != ((dcrp_eren) & (~FMC_DCRP_EADDR0_DCRP_EREN))) || \
                                                                                            ((dcrp_start) > DCRP_AREA_SUBPAGE_MAX_INDEX) || \
                                                                                            ((dcrp_end) > DCRP_AREA_SUBPAGE_MAX_INDEX)   || \
                                                                                            ((dcrp_end) < (dcrp_start))) 

/* check FMC WP area configuration */
#define NOT_FMC_WP_AREA_VALID_CFG(wp_area,wp_start,wp_end)   ((((wp_area) != WP_AREA_0) && ((wp_area) != WP_AREA_1)) || \
                                                               ((wp_start) > (MAIN_FLASH_PAGE_TOTAL_NUM - 1U))       || \
                                                               ((wp_end) > (MAIN_FLASH_PAGE_TOTAL_NUM - 1U))         || \
                                                               ((wp_end) < (wp_start)))

/* check FMC data flash page number */
#define NOT_FMC_VALID_DATA_FLASH_PAGE(page_num)              ((page_num) > (DATA_FLASH_PAGE_TOTAL_NUM - 1U))
#endif 

/* function declarations */
/* FMC main flash operation functions */
/* unlock the main FMC operation */
void fmc_unlock(void);
/* lock the main FMC operation */
void fmc_lock(void);
/* get the main flash  empty check status */
FlagStatus fmc_main_flash_empty_stat_get(void);
/* modify the main flash empty check status */
void fmc_main_flash_empty_stat_modify(uint32_t empty_check_status);
/* set the wait state */
void fmc_wscnt_set(uint32_t wscnt);
/* enable pre-fetch */
void fmc_prefetch_enable(void);
/* disable pre-fetch */
void fmc_prefetch_disable(void);
/* enable IBUS cache */
void fmc_icache_enable(void);
/* disable IBUS cache */
void fmc_icache_disable(void);
/* reset IBUS cache  */
void fmc_icache_reset(void);
/* erase page */
fmc_state_enum fmc_page_erase(uint32_t page_number);
/* erase whole chip */
fmc_state_enum fmc_mass_erase(void);
/* program a doubleword at the given address in main flash */
fmc_state_enum fmc_doubleword_program(uint32_t address, uint64_t data);
/* fast program a row at the corresponding address */
fmc_state_enum fmc_fast_program(uint32_t address, uint32_t data_buf);
/* enable debugger */
void fmc_debugger_enable(void);
/* disable debugger */
void fmc_debugger_disable(void);
/* enable secure area protection */
void fmc_scr_area_enable(void);

/* FMC option bytes operation functions */
/* unlock the option bytes operation */
void ob_unlock(void);
/* lock the option bytes operation */
void ob_lock(void);
/* reload the option bytes operation */
void ob_reload(void);
/* program the option bytes USER */
fmc_state_enum ob_user_write(uint32_t ob_user, uint32_t ob_user_mask);
/* configure security protection level*/
fmc_state_enum ob_security_protection_level_config(uint8_t ob_spc);
/* configure the option bytes DCRP area */
fmc_state_enum ob_dcrp_area_config(uint32_t dcrp_area, uint32_t dcrp_eren, uint32_t dcrp_start,
                                   uint32_t dcrp_end);
/* configure the option bytes write protection area */
fmc_state_enum ob_write_protection_area_config(uint32_t wp_area, uint32_t wp_start,
                                               uint32_t wp_end);
/* configure the option bytes secure area */
fmc_state_enum ob_scr_area_config(uint32_t secure_size);
/* configure the option bytes boot lock */
fmc_state_enum ob_boot_lock_config(uint32_t boot_config);
/* get the value of option bytes USER */
uint32_t ob_user_get(ob_user_data_extract_info_enum user_data_extract_info, uint8_t * ob_user_data);
/* get the value of option bytes security protection level in FMC_OBCTL register */
uint8_t ob_security_protection_level_get(void);
/* get configuration of DCRP area*/
uint32_t ob_dcrp_area_get(uint32_t dcrp_area, uint32_t *dcrp_erase_option,
                          uint32_t *dcrp_start, uint32_t *dcrp_end);
/* get address of write protection area */
uint32_t ob_write_protection_area_get(uint32_t wp_area, uint32_t *wp_start,
                                      uint32_t *wp_end);
/* get size of secure area */
uint32_t ob_scr_area_get(uint32_t *scr_area_byte_cnt);
/* get boot lock configuration */
uint32_t ob_boot_lock_get(void);

/* FMC interrupts and flags management functions */
/* get FMC flag status */
FlagStatus fmc_flag_get(uint32_t flag);
/* clear the FMC flag */
void fmc_flag_clear(uint32_t flag);
/* enable FMC interrupt */
void fmc_interrupt_enable(uint32_t interrupt);
/* disable FMC interrupt */
void fmc_interrupt_disable(uint32_t interrupt);
/* get FMC interrupt flag */
FlagStatus fmc_interrupt_flag_get(uint32_t flag);
/* clear FMC interrupt flag */
void fmc_interrupt_flag_clear(uint32_t flag);
/* get the FMC state*/
fmc_state_enum fmc_state_get(void);
/* check whether FMC is ready or not */
fmc_state_enum fmc_ready_wait(uint32_t timeout);

#endif /* GD32C2X1_FMC_H */
